export default {
  projections: {
    КтоE: {
      код: {
        __caption__: 'Код'
      },
      дата: {
        __caption__: 'Дата'
      },
      сотрудники: {
        __caption__: 'Сотрудники',
        фамилия: {
          __caption__: 'Фамилия'
        }
      }
    },
    КтоL: {
      код: {
        __caption__: 'Код'
      },
      дата: {
        __caption__: 'Дата'
      },
      сотрудники: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        },
        имя: {
          __caption__: 'Имя'
        },
        отчество: {
          __caption__: 'Отчество'
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата'
    },
    код: {
      __caption__: 'Код'
    },
    сотрудники: {
      __caption__: 'Сотрудники'
    }
  }
};
