export default {
  projections: {
    СотрудникиE: {
      код: {
        __caption__: 'Код'
      },
      фамилия: {
        __caption__: 'Фамилия'
      },
      имя: {
        __caption__: 'Имя'
      },
      отчество: {
        __caption__: 'Отчество'
      },
      телефон: {
        __caption__: 'Телефон'
      },
      должности: {
        __caption__: 'Должности',
        название: {
          __caption__: 'Название'
        }
      }
    },
    СотрудникиL: {
      код: {
        __caption__: 'Код'
      },
      фамилия: {
        __caption__: 'Фамилия'
      },
      имя: {
        __caption__: 'Имя'
      },
      отчество: {
        __caption__: 'Отчество'
      },
      телефон: {
        __caption__: 'Телефон'
      },
      должности: {
        __caption__: 'Название',
        название: {
          __caption__: 'Название'
        }
      }
    }
  },
  validations: {
    имя: {
      __caption__: 'Имя'
    },
    код: {
      __caption__: 'Код'
    },
    отчество: {
      __caption__: 'Отчество'
    },
    телефон: {
      __caption__: 'Телефон'
    },
    фамилия: {
      __caption__: 'Фамилия'
    },
    должности: {
      __caption__: 'Должности'
    }
  }
};
